app/controllers/answered_questions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "choices".* FROM "choices" WHERE "choices"."question_id" = ? LIMIT 1  [["question_id", 1]]
INSERT INTO "answered_questions" ("choice_id", "question_factory_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["choice_id", 302], ["question_factory_id", 1], ["user_id", 1], ["created_at", "2015-08-27 22:08:15.600144"], ["updated_at", "2015-08-27 22:08:15.600144"]]
---
    def create
       user = User.find(answeredQuestion_params[:user_id])
       choice = Choice.find(answeredQuestion_params[:choice_id])
       qf = choice.question.question_factory
       logger.debug "Choice is: #{choice.inspect}; qf is #{qf.inspect}"
       @answered_question = AnsweredQuestion.create(choice: choice, question_factory: qf, user: user)