app/controllers/question_factories_controller.rb

SELECT  "question_factories".* FROM "question_factories" WHERE "question_factories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "choices".* FROM "choices" WHERE "choices"."question_id" = ?  ORDER BY "choices"."order" ASC  [["question_id", 126]]
---
    def show
        @factory = QuestionFactory.find(params[:id])
        @question = @factory.make_question
        @choices = @question.choices
        @choices = @choices.order(:order)