app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "question_factories".* FROM "question_factories"  ORDER BY "question_factories"."id" ASC LIMIT 1000
---
  def show
    @user = User.find(params[:id])
    @question_factories =  Array.new
    QuestionFactory.find_each do |qf|